
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch02.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="ch01.html">
            
                <a href="ch01.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="ch02.html">
            
                <a href="ch02.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch03.html">
            
                <a href="ch03.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch04.html">
            
                <a href="ch04.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第一章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="ch01-&#x6625;">ch01 &#x6625;</h1>
<p>&#x4F5C;&#x8005;&#xFF1A;&#x6731;&#x81EA;&#x6E05;
&#x6B63;&#x6587;&#xFF1A;
&#x76FC;&#x671B;&#x7740;&#xFF0C;&#x76FC;&#x671B;&#x7740;&#xFF0C;&#x4E1C;&#x98CE;&#x6765;&#x4E86;&#xFF0C;&#x6625;&#x5929;&#x7684;&#x811A;&#x6B65;&#x8FD1;&#x4E86;&#x3002;</p>
<p>&#x4E00;&#x5207;&#x90FD;&#x50CF;&#x521A;&#x7761;&#x9192;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x6B23;&#x6B23;&#x7136;&#x5F20;&#x5F00;&#x4E86;&#x773C;&#x3002;&#x5C71;&#x6717;&#x6DA6;&#x8D77;&#x6765;&#x4E86;&#xFF0C;&#x6C34;&#x6DA8;&#x8D77;&#x6765;&#x4E86;&#xFF0C;&#x592A;&#x9633;&#x7684;&#x8138;&#x7EA2;&#x8D77;&#x6765;&#x4E86;&#x3002;&#x5C0F;&#x8349;&#x5077;&#x5077;&#x5730;&#x4ECE;&#x571F;&#x91CC;&#x94BB;&#x51FA;&#x6765;&#xFF0C;&#x5AE9;&#x5AE9;&#x7684;&#xFF0C;&#x7EFF;&#x7EFF;&#x7684;&#x3002;&#x56ED;&#x5B50;&#x91CC;&#xFF0C;&#x7530;&#x91CE;&#x91CC;&#xFF0C;&#x77A7;&#x53BB;&#xFF0C;&#x4E00;&#x5927;&#x7247;&#x4E00;&#x5927;&#x7247;&#x6EE1;&#x662F;&#x7684;&#x3002;&#x5750;&#x7740;&#xFF0C;&#x8EBA;&#x7740;&#xFF0C;&#x6253;&#x4E24;&#x4E2A;&#x6EDA;&#xFF0C;&#x8E22;&#x51E0;&#x811A;&#x7403;&#xFF0C;&#x8D5B;&#x51E0;&#x8D9F;&#x8DD1;&#xFF0C;&#x6349;&#x51E0;&#x56DE;&#x8FF7;&#x85CF;&#x3002;&#x98CE;&#x8F7B;&#x6084;&#x6084;&#x7684;&#xFF0C;&#x8349;&#x8F6F;&#x7EF5;&#x7EF5;&#x7684;&#x3002;</p>
<p>&#x6843;&#x6811;&#x3001;&#x674F;&#x6811;&#x3001;&#x68A8;&#x6811;&#xFF0C;&#x4F60;&#x4E0D;&#x8BA9;&#x6211;&#xFF0C;&#x6211;&#x4E0D;&#x8BA9;&#x4F60;&#xFF0C;&#x90FD;&#x5F00;&#x6EE1;&#x4E86;&#x82B1;&#x8D76;&#x8D9F;&#x513F;&#x3002;&#x7EA2;&#x7684;&#x50CF;&#x706B;&#xFF0C;&#x7C89;&#x7684;&#x50CF;&#x971E;&#xFF0C;&#x767D;&#x7684;&#x50CF;&#x96EA;&#x3002;&#x82B1;&#x91CC;&#x5E26;&#x7740;&#x751C;&#x5473;&#x513F;&#xFF1B;&#x95ED;&#x4E86;&#x773C;&#xFF0C;&#x6811;&#x4E0A;&#x4EFF;&#x4F5B;&#x5DF2;&#x7ECF;&#x6EE1;&#x662F;&#x6843;&#x513F;&#x3001;&#x674F;&#x513F;&#x3001;&#x68A8;&#x513F;&#x3002;</p>
<p>&#x82B1;&#x4E0B;&#x6210;&#x5343;&#x6210;&#x767E;&#x7684;&#x871C;&#x8702;&#x55E1;&#x55E1;&#x5730;&#x95F9;&#x7740;&#xFF0C;&#x5927;&#x5C0F;&#x7684;&#x8774;&#x8776;&#x98DE;&#x6765;&#x98DE;&#x53BB;&#x3002;&#x91CE;&#x82B1;&#x904D;&#x5730;&#x662F;&#xFF1A;&#x6742;&#x6837;&#x513F;&#xFF0C;&#x6709;&#x540D;&#x5B57;&#x7684;&#xFF0C;&#x6CA1;&#x540D;&#x5B57;&#x7684;&#xFF0C;&#x6563;&#x5728;&#x8349;&#x4E1B;&#x91CC;&#xFF0C;&#x50CF;&#x773C;&#x775B;&#xFF0C;&#x50CF;&#x661F;&#x661F;&#xFF0C;&#x8FD8;&#x7728;&#x5440;&#x7728;&#x7684;&#x3002;</p>
<p>&#x201C;&#x5439;&#x9762;&#x4E0D;&#x5BD2;&#x6768;&#x67F3;&#x98CE;&#x201D;&#xFF0C;&#x4E0D;&#x9519;&#x7684;&#xFF0C;&#x50CF;&#x6BCD;&#x4EB2;&#x7684;&#x624B;&#x629A;&#x6478;&#x7740;&#x4F60;&#x3002;&#x98CE;&#x91CC;&#x5E26;&#x6765;&#x4E9B;&#x65B0;&#x7FFB;&#x7684;&#x6CE5;&#x571F;&#x7684;&#x6C14;&#x606F;&#xFF0C;&#x6DF7;&#x7740;&#x9752;&#x8349;&#x5473;&#x513F;&#xFF0C;&#x8FD8;&#x6709;&#x5404;&#x79CD;&#x82B1;&#x7684;&#x9999;&#xFF0C;&#x90FD;&#x5728;&#x5FAE;&#x5FAE;&#x6DA6;&#x6E7F;&#x7684;&#x7A7A;&#x6C14;&#x91CC;&#x915D;&#x917F;&#x3002;</p>
<p>&#x9E1F;&#x513F;&#x5C06;&#x5DE2;&#x5B89;&#x5728;&#x7E41;&#x82B1;&#x5AE9;&#x53F6;&#x5F53;&#x4E2D;&#xFF0C;&#x9AD8;&#x5174;&#x8D77;&#x6765;&#x4E86;&#xFF0C;&#x547C;&#x670B;&#x5F15;&#x4F34;&#x5730;&#x5356;&#x5F04;&#x6E05;&#x8106;&#x7684;&#x5589;&#x5499;&#xFF0C;&#x5531;&#x51FA;&#x5B9B;&#x8F6C;&#x7684;&#x66F2;&#x5B50;&#xFF0C;&#x4E0E;&#x8F7B;&#x98CE;&#x6D41;&#x6C34;&#x5E94;&#x548C;&#x7740;&#x3002;&#x725B;&#x80CC;&#x4E0A;&#x7267;&#x7AE5;&#x7684;&#x77ED;&#x7B1B;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x4E5F;&#x6210;&#x5929;&#x5639;&#x4EAE;&#x5730;&#x54CD;&#x7740;&#x3002;</p>
<p>&#x96E8;&#x662F;&#x6700;&#x5BFB;&#x5E38;&#x7684;&#xFF0C;&#x4E00;&#x4E0B;&#x5C31;&#x662F;&#x4E09;&#x4E24;&#x5929;&#x3002;&#x53EF;&#x522B;&#x607C;&#x3002;&#x770B;&#xFF0C;&#x50CF;&#x725B;&#x6BDB;&#xFF0C;&#x50CF;&#x82B1;&#x9488;&#xFF0C;&#x50CF;&#x7EC6;&#x4E1D;&#xFF0C;&#x5BC6;&#x5BC6;&#x5730;&#x659C;&#x7EC7;&#x7740;&#xFF0C;&#x4EBA;&#x5BB6;&#x5C4B;&#x9876;&#x4E0A;&#x5168;&#x7B3C;&#x7740;&#x4E00;&#x5C42;&#x8584;&#x70DF;&#x3002;&#x6811;&#x53F6;&#x513F;&#x5374;&#x7EFF;&#x5F97;&#x53D1;&#x4EAE;&#xFF0C;&#x5C0F;&#x8349;&#x513F;&#x4E5F;&#x9752;&#x5F97;&#x903C;&#x4F60;&#x7684;&#x773C;&#x3002;&#x508D;&#x665A;&#x65F6;&#x5019;&#xFF0C;&#x4E0A;&#x706F;&#x4E86;&#xFF0C;&#x4E00;&#x70B9;&#x70B9;&#x9EC4;&#x6655;&#x7684;&#x5149;&#xFF0C;&#x70D8;&#x6258;&#x51FA;&#x4E00;&#x7247;&#x5B89;&#x9759;&#x800C;&#x548C;&#x5E73;&#x7684;&#x591C;&#x3002;</p>
<p>&#x5728;&#x4E61;&#x4E0B;&#xFF0C;&#x5C0F;&#x8DEF;&#x4E0A;&#xFF0C;&#x77F3;&#x6865;&#x8FB9;&#xFF0C;&#x6709;&#x6491;&#x8D77;&#x4F1E;&#x6162;&#x6162;&#x8D70;&#x7740;&#x7684;&#x4EBA;&#xFF0C;&#x5730;&#x91CC;&#x8FD8;&#x6709;&#x5DE5;&#x4F5C;&#x7684;&#x519C;&#x6C11;&#xFF0C;&#x62AB;&#x7740;&#x84D1;&#x6234;&#x7740;&#x7B20;&#x3002;&#x4ED6;&#x4EEC;&#x7684;&#x623F;&#x5C4B;&#xFF0C;&#x7A00;&#x7A00;&#x758F;&#x758F;&#x7684;&#x5728;&#x96E8;&#x91CC;&#x9759;&#x9ED8;&#x7740;&#x3002;</p>
<p>&#x5929;&#x4E0A;&#x98CE;&#x7B5D;&#x6E10;&#x6E10;&#x591A;&#x4E86;&#xFF0C;&#x5730;&#x4E0A;&#x5B69;&#x5B50;&#x4E5F;&#x591A;&#x4E86;&#x3002;&#x57CE;&#x91CC;&#x4E61;&#x4E0B;&#xFF0C;&#x5BB6;&#x5BB6;&#x6237;&#x6237;&#xFF0C;&#x8001;&#x8001;&#x5C0F;&#x5C0F;&#xFF0C;&#x4E5F;&#x8D76;&#x8D9F;&#x513F;&#x4F3C;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2A;&#x90FD;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x8212;&#x6D3B;&#x8212;&#x6D3B;&#x7B4B;&#x9AA8;&#xFF0C;&#x6296;&#x64DE;&#x6296;&#x64DE;&#x7CBE;&#x795E;&#xFF0C;&#x5404;&#x505A;&#x5404;&#x7684;&#x4E00;&#x4EFD;&#x4E8B;&#x53BB;&#x3002;&#x201C;&#x4E00;&#x5E74;&#x4E4B;&#x8BA1;&#x5728;&#x4E8E;&#x6625;&#x201D;&#xFF0C;&#x521A;&#x8D77;&#x5934;&#x513F;&#xFF0C;&#x6709;&#x7684;&#x662F;&#x5DE5;&#x592B;&#xFF0C;&#x6709;&#x7684;&#x662F;&#x5E0C;&#x671B;&#x3002;</p>
<p>&#x6625;&#x5929;&#x50CF;&#x521A;&#x843D;&#x5730;&#x7684;&#x5A03;&#x5A03;&#xFF0C;&#x4ECE;&#x5934;&#x5230;&#x811A;&#x90FD;&#x662F;&#x65B0;&#x7684;&#xFF0C;&#x5B83;&#x751F;&#x957F;&#x7740;&#x3002;&#x6625;&#x5929;&#x50CF;&#x5C0F;&#x59D1;&#x5A18;&#xFF0C;&#x82B1;&#x679D;&#x62DB;&#x5C55;&#x7684;&#xFF0C;&#x7B11;&#x7740;&#xFF0C;&#x8D70;&#x7740;&#x3002;&#x6625;&#x5929;&#x50CF;&#x5065;&#x58EE;&#x7684;&#x9752;&#x5E74;&#xFF0C;&#x6709;&#x94C1;&#x4E00;&#x822C;&#x7684;&#x80F3;&#x818A;&#x548C;&#x8170;&#x811A;&#xFF0C;&#x9886;&#x7740;&#x6211;&#x4EEC;&#x4E0A;&#x524D;&#x53BB;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 简介">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch02.html" class="navigation navigation-next " aria-label="Next page: 第二章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一章","level":"1.2","depth":1,"next":{"title":"第二章","level":"1.3","depth":1,"path":"ch02.md","ref":"ch02.md","articles":[]},"previous":{"title":"简介","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch01.md","mtime":"2021-03-31T10:04:20.873Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-03-31T10:15:21.312Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

