
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第四章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="ch03.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="ch01.html">
            
                <a href="ch01.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="ch02.html">
            
                <a href="ch02.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch03.html">
            
                <a href="ch03.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="ch04.html">
            
                <a href="ch04.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第四章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="ch04-&#x6D4E;&#x5357;&#x7684;&#x6625;&#x5929;">ch04 &#x6D4E;&#x5357;&#x7684;&#x6625;&#x5929;</h1>
<p>&#x4F5C;&#x8005;&#xFF1A;&#x8001;&#x820D;
&#x6B63;&#x6587;&#xFF1A;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x4E0D;&#x66FE;&#x5728;&#x6D4E;&#x5357;&#x5F85;&#x8FC7;&#x7684;&#x4EBA;&#xFF0C;&#x5F53;&#x7136;&#x662F;&#x4E0D;&#x77E5;&#x9053;&#x6625;&#x5929;&#x50CF;&#x6781;&#x4E86;&#x6BDB;&#x624B;&#x6BDB;&#x811A;&#x7684;&#x5C0F;&#x4F19;&#x5B50;&#x82E5;&#x662F;&#x6709;&#x4E2A;&#x7A7F;&#x5355;&#x8863;&#x8E0F;&#x9752;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4FBF;&#x8FD8;&#x771F;&#x89C9;&#x5F97;&#x6709;&#x70B9;&#x4E0D;&#x53EF;&#x601D;&#x8BAE;;&#x6D4E;&#x5357;&#x7684;&#x6625;&#x5929;&#x662F;&#x88AB;&#x88CF;&#x631F;&#x7740;&#x6765;&#x7684;&#xFF0C;&#x6625;&#x5929;&#x5149;&#x4E34;&#x522B;&#x7684;&#x57CE;&#x5E02;&#xFF0C;&#x4F1A;&#x5148;&#x6253;&#x4E2A;&#x62DB;&#x547C;&#xFF0C;&#x4E0B;&#x4EFD;&#x5E16;&#x5B50;&#xFF0C;&#x65F6;&#x65F6;&#x5E26;&#x7740;&#x70B9;&#x6587;&#x8D28;&#x5F6C;&#x5F6C;&#x7684;&#x52B2;&#x513F;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x5BF9;&#x4E8E;&#x4ECE;&#x5357;&#x65B9;&#x56DE;&#x6765;&#x7684;&#x6E38;&#x5B50;&#xFF0C;&#x50CF;&#x6211;&#xFF0C;&#x770B;&#x7740;&#x65E5;&#x5149;&#x6D12;&#x4E0B;&#x6765;&#x4E86;&#xFF0C;&#x6B20;&#x6B20;&#x7684;&#x601D;&#x91CF;&#x7740;&#x660E;&#x65E9;&#x5F97;&#x6362;&#x4E0B;&#x81C3;&#x80BF;&#x7684;&#x5916;&#x5957;&#xFF0C;&#x582A;&#x582A;&#x5230;&#x4E86;&#x65E9;&#x4E0A;&#xFF0C;&#x53C8;&#x8FD8;&#x662F;&#x628A;&#x81EA;&#x5DF1;&#x5305;&#x6210;&#x4E86;&#x6C64;&#x5706;&#x3002;&#x6D4E;&#x5357;&#x7684;&#x6625;&#x5929;&#x662F;&#x6709;&#x58F0;&#x97F3;&#x7684;&#x3002;&#x81EA;&#x7136;&#xFF0C;&#x5728;&#x6D77;&#x8FB9;&#x90A3;&#x4E2A;&#x57CE;&#x5E02;&#x4E5F;&#x6709;&#x58F0;&#x97F3;&#xFF0C;&#x4F46;&#x90A3;&#x662F;&#x4E00;&#x9635;&#x9635;&#x62CD;&#x5CB8;&#x7684;&#x6D6A;&#x58F0;&#xFF0C;&#x8FD9;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x662F;&#x591C;&#x91CC;&#x7A97;&#x6237;&#x4E4C;&#x62C9;&#x4E4C;&#x62C9;&#x7684;&#x58F0;&#xFF0C;&#x4E0E;&#x6211;&#x8001;&#x5BB6;&#x9694;&#x58C1;&#x6751;&#x90A3;&#x4E2A;&#x4E8C;&#x50BB;&#x5B50;&#x62C9;&#x7684;&#x98CE;&#x7BB1;&#x4E00;&#x4E2A;&#x58F0;&#xFF0C;&#x542C;&#x7740;&#x53CD;&#x6709;&#x70B9;&#x53EB;&#x4EBA;&#x5BB3;&#x6015;&#x3002;</p>
<p>&#x53EF;&#x662F;&#xFF0C;&#x5728;&#x5317;&#x4E2D;&#x56FD;&#x7684;&#x6625;&#x5929;&#xFF0C;&#x800C;&#x5E26;&#x7740;&#x8FD9;&#x4E48;&#x4E00;&#x80A1;&#x5B50;&#x5929;&#x6717;&#x6C14;&#x6E05;&#x7684;&#x5730;&#xFF0C;&#x6D4E;&#x5357;&#x771F;&#x5F97;&#x7B97;&#x7684;&#x4E0A;&#x662F;&#x4E2A;&#x5B9D;&#x5730;&#x4E86;&#x3002;&#x8BBE;&#x82E5;&#x4EC5;&#x4EC5;&#x6709;&#x8FD9;&#x4E48;&#x70B9;&#x6E29;&#x5DEE;&#xFF0C;&#x90A3;&#x4E5F;&#x7B97;&#x4E0D;&#x4E86;&#x51FA;&#x5947;&#x3002;&#x90A3;&#x518D;&#x95ED;&#x4E0A;&#x773C;&#xFF0C;&#x5482;&#x6478;&#x4E00;&#x4E0B;:&#x4E00;&#x4E2A;&#x8001;&#x57CE;&#xFF0C;&#x6709;&#x5C71;&#x6709;&#x6C34;&#xFF0C;&#x90FD;&#x88AB;&#x8FD9;&#x5317;&#x98CE;&#x6216;&#x8005;&#x5357;&#x98CE;&#x5439;&#x7740;&#xFF0C;&#x8001;&#x5934;&#x8001;&#x592A;&#x592A;&#xFF0C;&#x4E5F;&#x4E0D;&#x8DF3;&#x90A3;&#x51E0;&#x4E2A;&#x66F2;&#x724C;&#x4E86;&#xFF0C;&#x5C31;&#x5728;&#x5899;&#x6839;&#x5B50;&#x4E0B;&#x9762;&#xFF0C;&#x7B49;&#x7740;&#x98CE;&#xFF0C;&#x60F3;&#x7740;&#x98CE;&#x6765;&#x4E86;&#xFF0C;&#x4ECE;&#x9A91;&#x6765;&#x7684;&#x4E09;&#x8F6E;&#x8F66;&#x5EA7;&#x5B50;&#x4E0B;&#x9762;&#xFF0C;&#x638F;&#x51FA;&#x4E2A;&#x9F13;&#x9F13;&#x56CA;&#x7684;&#x5BB6;&#x4F19;&#x662F;&#xFF0C;&#x4E0D;&#x7528;&#x731C;&#xFF0C;&#x51C6;&#x662F;&#x53BB;&#x5E74;&#x7559;&#x4E0B;&#x7684;&#x98CE;&#x7B5D;&#x513F;&#xFF0C;&#x6837;&#x5B50;&#x4E0D;&#x662F;&#x98DE;&#x673A;&#xFF0C;&#x5C31;&#x662F;&#x7EB8;&#x7247;&#x5E03;&#x5B50;&#xFF0C;&#x6015;&#x6709;&#x4EBA;&#x7528;&#x4E2A;&#x83E9;&#x8428;&#x9020;&#x578B;&#xFF0C;&#x5728;&#x6D4E;&#x5357;&#x591A;&#x89C1;&#x7684;&#x9634;&#x5929;&#x65F6;&#x8282;&#x653E;&#x51FA;&#x53BB;&#xFF0C;&#x4E5F;&#x4FDD;&#x4E0D;&#x9F50;&#x662F;&#x4E2A;&#x795E;&#x4ED9;&#x4E0B;&#x51E1;&#x7684;&#x4F20;&#x95FB;&#x3002;&#x6625;&#x98CE;&#x4E0D;&#x662F;&#x5439;&#x8349;&#xFF0C;&#x5439;&#x67F3;&#x6811;&#x7684;&#xFF0C;&#x5B83;&#x6765;&#x628A;&#x8FD9;&#x4E9B;&#x5728;&#x5BD2;&#x51AC;&#x91CC;&#x633A;&#x4E0B;&#x6765;&#x7684;&#x8001;&#x5BB6;&#x4F19;&#x4EEC;&#x5524;&#x9192;&#xFF0C;&#x4F60;&#x8BF4;&#x8FD9;&#x662F;&#x4E0D;&#x662F;&#x4E2A;&#x7406;&#x60F3;&#x7684;&#x753B;&#x9762;?</p>
<p>&#x6D4E;&#x5357;&#x591A;&#x540D;&#x58EB;&#xFF0C;&#x8F6C;&#x5C71;&#x770B;&#x4E0D;&#x9F50;&#x3002;&#x6D4E;&#x5357;&#x7684;&#x5C0F;&#x5C71;&#x6574;&#x628A;&#x6D4E;&#x5357;&#x56F4;&#x4E86;&#x4E2A;&#x5708;&#x513F;&#xFF0C;&#x504F;&#x504F;&#x9732;&#x51FA;&#x4E00;&#x89D2;&#xFF0C;&#x5F53;&#x5E74;&#x97E9;&#x4E3B;&#x5E2D;&#x5C31;&#x4ECE;&#x90A3;&#x4E2A;&#x5C0F;&#x89D2;&#x8DD1;&#x4E86;&#xFF0C;&#x7559;&#x4E0B;&#x6765;&#x4E86;&#x90A3;&#x51E0;&#x9996;&#x540D;&#x8BD7;&#x540D;&#x53E5;&#x3002;&#x8BF4;&#x53EA;&#x6709;&#x5317;&#x8FB9;&#x7740;&#x70B9;&#x53E3;&#x513F;&#xFF0C;&#x5012;&#x8BA9;&#x7740;&#x8FD9;&#x4E00;&#x5708;&#x5C0F;&#x5C71;&#x5728;&#x6625;&#x5929;&#x65F6;&#x5019;&#xFF0C;&#x7279;&#x522B;&#x7A81;&#x5140;&#x3002;&#x8FDC;&#x8FDC;&#x671B;&#x53BB;&#xFF0C;&#x770B;&#x7684;&#x5C31;&#x662F;&#x98CE;&#x5439;&#x5C71;&#x5934;&#x6F2B;&#x5377;&#x897F;&#x98CE;&#xFF0C;&#x6D4E;&#x5357;&#x4E5F;&#x5C31;&#x5728;&#x8FD9;&#x4E2A;&#x5C0F;&#x6447;&#x7BEE;&#x91CC;&#xFF0C;&#x745F;&#x745F;&#x53D1;&#x6392;&#xFF0C;&#x60F3;&#x5FF5;&#x814A;&#x6708;&#x7559;&#x4E0B;&#x7684;&#x9635;&#x9635;&#x96EA;&#x82B1;&#xFF0C;&#x6015;&#x4E5F;&#x968F;&#x7740;&#x586C;&#x4E0A;&#x4E00;&#x6837;&#xFF0C;&#x8FC7;&#x4E86;&#x60CA;&#x86F0;&#xFF0C;&#x843D;&#x5230;&#x5730;&#x4E0A;&#x5C31;&#x4E0D;&#x89C1;&#x4E86;&#x3002;&#x771F;&#x7684;&#xFF0C;&#x6D4E;&#x5357;&#x7684;&#x4EBA;&#x4EEC;&#x5728;&#x6625;&#x5929;&#x662F;&#x9762;&#x4E0A;&#x542B;&#x7B11;&#x7684;&#xFF0C;&#x50BB;&#x4E50;&#x3001;&#x6CA1;&#x6709;&#x51AC;&#x5929;&#x7684;&#x5C40;&#x4FC3;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x521D;&#x590F;&#x7684;&#x70DF;&#x706B;&#x5473;&#xFF0C;&#x5C31;&#x662F;&#x770B;&#x7740;&#x9EC4;&#x8349;&#x53D8;&#x7EFF;&#xFF0C;&#x5C31;&#x83AB;&#x540D;&#x5F00;&#x5FC3;&#xFF0C;&#x4E5F;&#x96BE;&#x602A;&#xFF0C;&#x5B69;&#x5B50;&#x5927;&#x4E86;&#x4E00;&#x5C81;&#x3001;&#x7236;&#x6BCD;&#x8001;&#x4E86;&#x4E00;&#x5C81;&#x3002;&#x4ED6;&#x4EEC;&#x518D;&#x53BB;&#x770B;&#x90A3;&#x4E9B;&#x5C0F;&#x5C71;&#xFF0C;&#x5FC3;&#x4E2D;&#x4FBF;&#x89C9;&#x5F97;&#x6709;&#x4E86;&#x7740;&#x843D;&#xFF0C;&#x6709;&#x4E86;&#x4F9D;&#x9760;&#xFF0C;&#x4FBF;&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x5730;&#x60F3;&#x8D77;&#x3002;&#x201C;&#x6625;&#x5929;&#x4E5F;&#x5C31;&#x8FD9;&#x6837;&#x4E86;&#x5427;?&#x8FD9;&#x6837;&#x7684;&#x6E29;&#x6696;&#x3001;&#x4ECA;&#x5929;&#x591C;&#x91CC;&#x5C71;&#x8349;&#x4E5F;&#x8BB8;&#x5C31;&#x7EFF;&#x8D77;&#x6765;&#x4E86;&#x5427;?&#x4EE4;&#x4EBA;&#x4E0D;&#x60A6;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x70B9;&#x5E7B;&#x60F3;&#xFF0C;&#x5374;&#x4E0D;&#x80FD;&#x4E00;&#x65F6;&#x5B9E;&#x73B0;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x5F00;&#x59CB;&#x6376;&#x8DB3;&#x987F;&#x80F8;&#x3002;&#x6BD5;&#x7ADF;&#x6D4E;&#x5357;&#x7559;&#x7ED9;&#x4EBA;&#x4EEC;&#x7684;&#x6625;&#x5929;&#x4E0D;&#x591A;&#x4E86;&#x3002;</p>
<p>&#x6700;&#x5999;&#x7684;&#x662F;&#x4E0B;&#x70B9;&#x96E8;&#x5440;&#x3002;&#x7B49;&#x7740;&#x5427;&#xFF0C;&#x96E8;&#x6C34;&#x5E26;&#x7740;&#x53BB;&#x5E74;&#x7164;&#x70AD;&#x7684;&#x7070;&#x70EC;&#xFF0C;&#x98D8;&#x98D8;&#x6D12;&#x6D12;&#x843D;&#x5728;&#x4F60;&#x5E72;&#x7D20;&#x7684;&#x5355;&#x8863;&#x4E0A;&#xFF0C;&#x8FDC;&#x5904;&#x5C71;&#x4E0A;&#x7684;&#x77EE;&#x677E;&#x5C31;&#x8D8A;&#x53D1;&#x7684;&#x9752;&#x9ED1;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6811;&#x5C16;&#x4E0A;&#x9876;&#x7740;&#x4E00;&#x62B9;&#x9332;&#xFF0C;&#x597D;&#x50CF;&#x662F;&#x4E2A;&#x62AB;&#x7532;&#x4EBA;&#x3002;&#x6811;&#x6728;&#x5E26;&#x7740;&#x7EFF;&#x610F;&#xFF0C;&#x98CE;&#x7B5D;&#x4E0D;&#x65F6;&#x5C31;&#x614C;&#x4E86;&#x795E;&#xFF0C;&#x843D;&#x5728;&#x6811;&#x4E0A;&#xFF0C;&#x7ED9;&#x8FD8;&#x6CA1;&#x957F;&#x65B0;&#x53F6;&#x7684;&#x6811;&#x5E72;&#xFF0C;&#x9576;&#x4E0A;&#x88C5;&#x6F62;&#x3002;&#x8349;&#x5730;&#x4E0A;&#xFF0C;&#x6B64;&#x65F6;&#x5206;&#x4E0D;&#x51FA;&#x5F88;&#x660E;&#x663E;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x9EC4;&#x7EFF;&#x4EA4;&#x9519;&#xFF0C;&#x6709;&#x7684;&#x5730;&#x65B9;&#x9EC4;&#x571F;&#x8FD8;&#x9732;&#x7740;&#x8FD9;&#x6837;&#xFF0C;&#x4E00;&#x9053;&#x513F;&#x7EFF;&#xFF0C;&#x4E00;&#x9053;&#x513F;&#x6697;&#x9EC4;&#xFF0C;&#x770B;&#x7740;&#x5C31;&#x50CF;&#x5B69;&#x5B50;&#x5C3F;&#x4E86;&#x7095;;&#x770B;&#x7740;&#x770B;&#x7740;&#xFF0C;&#x8FD9;&#x5730;&#x56FE;&#x597D;&#x50CF;&#x8FD8;&#x80FD;&#x88AB;&#x98CE;&#x513F;&#x5439;&#x52A8;&#xFF0C;&#x53EB;&#x4F60;&#x83AB;&#x540D;&#x7684;&#x8138;&#x9891;&#x7EA2;&#x4E86;&#x8D77;&#x6765;&#x3002;&#x7B49;&#x5230;&#x5FEB;&#x56DE;&#x843D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5FAE;&#x9EC4;&#x7684;&#x9633;&#x5149;&#x659C;&#x5C04;&#x5728;&#x8FD9;&#x5730;&#x4E0A;&#xFF0C;&#x5927;&#x4EBA;&#x5B69;&#x5B50;&#x597D;&#x50CF;&#x8BB0;&#x8D77;&#x6765;&#x4EC0;&#x4E48;&#xFF0C;&#x6536;&#x62FE;&#x4E0B;&#x5C31;&#x6D88;&#x6563;&#x4E0D;&#x89C1;&#x3002;&#x4E00;&#x4F1A;&#x5149;&#x5F71;&#x56DB;&#x8D77;&#xFF0C;&#x591C;&#x6DF1;&#x4E86;&#xFF0C;&#x4E5F;&#x542C;&#x4E0D;&#x5230;&#x72AC;&#x5420;&#xFF0C;&#x65F6;&#x4E0D;&#x65F6;&#x8FDC;&#x5904;&#x8FD8;&#x80FD;&#x770B;&#x5230;&#xFF0C;&#x5F20;&#x7259;&#x821E;&#x722A;&#x7684;&#x7236;&#x6BCD;&#xFF0C;&#x90A3;&#x4E9B;&#x8D2A;&#x73A9;&#x4E00;&#x5929;&#x7684;&#x63A5;&#x5B50;&#x592A;&#x79C0;&#x6C14;&#xFF01;</p>
<p>&#x53E4;&#x8001;&#x7684;&#x6D4E;&#x5357;&#xFF0C;&#x57CE;&#x91CC;&#x90A3;&#x4E48;&#x72ED;&#x7A84;&#xFF0C;&#x57CE;&#x5916;&#x53C8;&#x90A3;&#x4E48;&#x5BBD;&#x655E;&#x3002;&#x8BB8;&#x662F;&#x65E9;&#x4E9B;&#x5E74;&#x95F4;&#xFF0C;&#x5927;&#x6237;&#x4EBA;&#x5BB6;&#x7684;&#x9AD8;&#x5899;&#x5927;&#x9662;&#x906E;&#x6321;&#x4E86;&#x592A;&#x591A;&#x7684;&#x70B9;&#x70B9;&#x661F;&#x5149;&#xFF0C;&#x8BA9;&#x57CE;&#x5916;&#x554A;&#xFF0C;&#x6563;&#x53D1;&#x7740;&#x8FF7;&#x4EBA;&#x7684;&#x5371;&#x9669;&#x3002;&#x71D5;&#x5B50;&#x674E;&#x4E09;&#xFF0C;&#x94C1;&#x5634;&#x9738;&#x738B;&#xFF0C;&#x8001;&#x6D4E;&#x5357;&#x7684;&#x4EBA;&#x4EEC;&#xFF0C;&#x628A;&#x5899;&#x91CC;&#x7684;&#x5FF5;&#x5934;&#x90FD;&#x5199;&#x5230;&#x4E86;&#x8FD9;&#x4E9B;&#x4EBA;&#x8EAB;&#x4E0A;&#xFF0C;&#x817E;&#x817E;&#x817E;&#xFF0C;&#x4E0A;&#x5899;&#x63ED;&#x74E6;&#xFF0C;&#x5237;&#x5237;&#x5237;&#xFF0C;&#x94B1;&#x8D70;&#x4EBA;&#x98DE;&#x3002;&#x867D;&#x4E0D;&#x4F3C;&#x97E9;&#x7199;&#x8F7D;&#x591C;&#x5BB4;&#x90A3;&#x822C;&#xFF0C;&#x4F46;&#x4E5F;&#x8BB8;&#x4E5F;&#x80FD;&#x7B97;&#x5F97;&#x4E0A;&#x5510;&#x4EE3;&#x7684;&#x540D;&#x624B;&#x753B;&#x7684;&#x5427;&#x3002;</p>
<p>&#x90A3;&#x6C34;&#x5462;&#xFF0C;&#x6C34;&#x9762;&#x4E0A;&#x65E9;&#x90FD;&#x6563;&#x6EE1;&#x4E86;&#x9E2D;&#x5B50;&#xFF0C;&#x6625;&#x6C5F;&#x6C34;&#x6696;&#x5B83;&#x5148;&#x77E5;&#x3002;&#x8FD9;&#x6C34;&#x662F;&#x6CC9;&#x773C;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x662F;&#x6E05;&#x6F88;&#x7684;&#xFF0C;&#x5012;&#x53CD;&#x5728;&#x4E0A;&#x5192;&#x7740;&#x70B9;&#x70ED;&#x6C14;&#xFF0C;&#x663E;&#x5F97;&#x6C34;&#x4EAE;&#x900F;&#xFF0C;&#x770B;&#x7740;&#x5C31;&#x50CF;&#x4ECA;&#x5E74;&#x8FC7;&#x5B8C;&#xFF0C;&#x660E;&#x5E74;&#x4E0D;&#x8FC7;&#x4E86;&#x4E00;&#x6837;&#xFF0C;&#x628A;&#x7EC8;&#x5E74;&#x8D2E;&#x84C4;&#x7684;&#x7EFF;&#x8272;&#x5168;&#x62FF;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x5B83;&#x4E5F;&#x662F;&#x77E5;&#x9053;&#x6D4E;&#x5357;&#x7684;&#x6625;&#x5929;&#x7684;&#x3002;&#x5929;&#x513F;&#x8D8A;&#x6674;&#x6C34;&#x85FB;&#x8D8A;&#x7EFF;&#xFF0C;&#x5C31;&#x51ED;&#x8FD9;&#x4E9B;&#x7EFF;&#x7684;&#x7CBE;&#x795E;&#xFF0C;&#x5439;&#x53E3;&#x7434;&#x7684;&#x5927;&#x7237;&#xFF0C;&#x6296;&#x7A7A;&#x7AF9;&#x7684;&#x5927;&#x7237;&#xFF0C;&#x90FD;&#x51FA;&#x6765;&#x4E00;&#x5C55;&#x62F3;&#x811A;&#x3002;&#x5927;&#x5988;&#x8FD9;&#x65F6;&#x5019;&#x5C31;&#x50CF;&#x5E74;&#x8F7B;&#x65F6;&#x4F9D;&#x7684;&#x8001;&#x4F34;&#xFF0C;&#x770B;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x5BB6;&#x8001;&#x5934;&#x5B50;&#xFF0C;&#x5386;&#x5BB3;&#x7684;&#x5F88;&#x3002;&#x56DB;&#x9762;&#x8377;&#x82B1;&#x4E09;&#x9762;&#x67F3;&#xFF0C;&#x51B5;&#x4E14;&#x90A3;&#x4E9B;&#x957F;&#x6280;&#x7684;&#x5782;&#x67F3;&#x8FD8;&#x8981;&#x5728;&#x6C34;&#x91CC;&#x7167;&#x4E2A;&#x5F71;&#x513F;&#x5462;&#xFF0C;&#x8FD9;&#x8377;&#x82B1;&#x4E5F;&#x7ED9;&#x4E86;&#x65E0;&#x6570;&#x6587;&#x4EBA;&#x5951;&#x673A;&#x7740;&#x5427;&#x3002;&#x5C71;&#x6F84;&#x6E05;&#x7684;&#x6CB3;&#x6C34;&#x6162;&#x6162;&#x5F80;&#x4E0A;&#x770B;&#x5427;&#xFF0C;&#x7A7A;&#x4E2D;&#xFF0C;&#x534A;&#x7A7A;&#x4E2D;&#xFF0C;&#x5929;&#x4E0A;&#x3002;&#x81EA;&#x4E0A;&#x800C;&#x4E0B;&#x5168;&#x662F;&#x90A3;&#x4E48;&#x6E05;&#x4EAE;&#xFF0C;&#x90A3;&#x4E48;&#x84DD;&#x6C6A;&#x7684;&#xFF0C;&#x6574;&#x4E2A;&#x7684;&#x662F;&#x5757;&#x7A7A;&#x7075;&#x7684;&#x84DD;&#x6C34;&#x54C1;&#x3002;&#x8FD9;&#x5757;&#x6C34;&#x54C1;&#x91CC;&#xFF0C;&#x5305;&#x7740;&#x7EA2;&#x5C4B;&#x9876;&#xFF0C;&#x9EC4;&#x8349;&#x5C71;&#xFF0C;&#x50CF;&#x5730;&#x78C1;&#x4E0A;&#x7684;&#x5C0F;&#x56E2;&#x82B1;&#x7684;&#x5C0F;&#x7070;&#x8272;&#x5F71;:&#x8FD9;&#x5C31;&#x662F;&#x6625;&#x5929;&#x7684;&#x6D4E;&#x5357;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch03.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 第三章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第四章","level":"1.5","depth":1,"previous":{"title":"第三章","level":"1.4","depth":1,"path":"ch03.md","ref":"ch03.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch04.md","mtime":"2021-03-31T10:01:20.553Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-03-31T10:01:25.451Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

